Revit 2026 API

# StairsPathDirection Enumeration

---

The direction style of stairs path.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum StairsPathDirection
```
```vb
Public Enumeration StairsPathDirection
```
```cpp
public enum class StairsPathDirection
```
```fsharp
type StairsPathDirection
```

| Member name | Value | Description |
| --- | --- | --- |
| AlwaysUp | 0 | The direction of the stair path will always be UP direction. |
| AutomaticUpDown | 1 | The direction of the stair path will be determined automatically. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace